<?php
  $n=readline("n=");
  echo "your input is $n\n";
  $m=readline("m=");
  echo "your input is $m\n";
  /*если не контролировать тотальную сумму экзепшенов + варнингов/2 и сложить варнинги раньше, то решение будет невозможно*/
  $c = $m;
  if (!($m%2 == 0) && ($m == 1)) {
    echo(-1); /*если варнинг 0*/
  } elseif ((0 <= $n && $n <= 1000) && (0 <= $m && $m <= 1000)) {
    while (!($m%2 == 0 && ($n+($m/2))%2 == 0)) {
      $m = $m+1;
    }
    echo(($n+$m/2/*усилия на схлопывание */+$m/*усилия на схлопывание варнинго*/)/2+($m-$c));
  } else {
    echo(-1); /*если варнинг 0*/
  }
?>
